Found missing IAM policy descriptions,  added back in and resulting in further reductions in destroys in the plan.

- **After Fix **: 25 adds, 20 changes, 25 destroys (production) - roles and policies preserved 

The remaining 25 adds/destroys are:

- IAM role policy attachments being recreated (expected - v5→v6 module renamed custom → this)
- 2 IAM role replacements:
            `transfer_server_iam_role`: Getting clean name (one-time cleanup) see [diff](https://github.com/ministryofjustice/modernisation-platform-environments/pull/15330/changes#diff-fc615c5609227b9f14191f00904e48cbb31417974bfb2e1ee6e37e6cef52143fR10) code change prevents random suffix generation 
            `laa_data_analysis_replication_iam_role`: Intentional name shortening as greater than character limit see [diff](https://github.com/ministryofjustice/modernisation-platform-environments/pull/15330/changes#diff-fc615c5609227b9f14191f00904e48cbb31417974bfb2e1ee6e37e6cef52143fR176)  basically shortened 
`role_name         = "laa-data-analysis-${local.environment}-replication"`
to
`name            = "laa-analysis-${local.environment}-repl"`


of the must be replaced the following has a change to the `cidr_blocks` which has not changed in code and i think ive seen before  and I have apparently  "This change happens every time in Ingestion"
```
  # module.datasync_activation_nlb_security_group.aws_security_group_rule.ingress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_rules" {
      ~ cidr_blocks              = [ # forces replacement
          ~ "64.236.200.229/32" -> "109.154.249.138/32",
        ]
      ~ id                       = "sgrule-1440702515" -> (known after apply)
      ~ security_group_rule_id   = "sgr-01364336c0051e271" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (10 unchanged attributes hidden)
    }
```